app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)
    @location.user_id = params[:user_id]

    if @location.save
---
INSERT INTO "locations" ("country", "city", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["country", "Ireland"], ["city", "Belfast"], ["created_at", "2020-05-10 02:18:09.067450"], ["updated_at", "2020-05-10 02:18:09.067450"], ["user_id", 7]]

  def update
    if @location.update(location_params)
---
UPDATE "locations" SET "country" = $1, "city" = $2, "landmarks" = $3, "season" = $4, "updated_at" = $5 WHERE "locations"."id" = $6  [["country", "The Netherlands"], ["city", "Amsterdam"], ["landmarks", "canals, tulip fields"], ["season", "spring"], ["updated_at", "2020-05-10 15:47:46.435899"], ["id", 2]]