app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "hometown", "interests", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jane"], ["hometown", "Chicago, IL"], ["interests", "photography"], ["created_at", "2020-05-12 23:40:31.149572"], ["updated_at", "2020-05-12 23:40:31.149572"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "hometown" = $2, "interests" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["name", ""], ["hometown", ""], ["interests", ""], ["updated_at", "2020-05-13 03:13:44.497724"], ["id", 1]]